## Setup

In [1]:
%load_ext sql

In [2]:
# Connect to sakila MySQL database
%sql mysql+mysqlconnector://iliarudiak:password@iliarudiak-macbook.local:3306/sakila

In [3]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## 01 Query Mechanics

In [7]:
%%sql
SELECT * FROM category LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 2, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 2, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 2, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 2, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 2, 46, 27))]

In [8]:
%%sql
SELECT * FROM language LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1, 'English', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (2, 'Italian', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (3, 'Japanese', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (4, 'Mandarin', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (5, 'French', datetime.datetime(2006, 2, 15, 3, 2, 19))]

In [9]:
%%sql
SELECT language_id, name, last_update 
FROM language 
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1, 'English', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (2, 'Italian', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (3, 'Japanese', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (4, 'Mandarin', datetime.datetime(2006, 2, 15, 3, 2, 19)),
 (5, 'French', datetime.datetime(2006, 2, 15, 3, 2, 19))]

## 02 Query Clauses

### 01 `SELECT` Clause

#### 01 Column Aliases

In [21]:
%%sql
SELECT language_id, 
        name,
        upper(name) AS name_upper
FROM language 
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1, 'English', 'ENGLISH'),
 (2, 'Italian', 'ITALIAN'),
 (3, 'Japanese', 'JAPANESE'),
 (4, 'Mandarin', 'MANDARIN'),
 (5, 'French', 'FRENCH')]

#### 03 Removing Duplicates

In [15]:
# Select `actor_id` from `film_actor` sorted in ascending order

In [25]:
%%sql
SELECT actor_id
FROM film_actor
ORDER BY actor_id ASC
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1,), (1,), (1,), (1,), (1,)]

In [ ]:
%%sql
/* The same with duplicates removed */
SELECT DISTINCT actor_id
FROM film_actor
ORDER BY actor_id ASC
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1,), (2,), (3,), (4,), (5,)]

### 02 `FROM` Clause

### 01 Derived tables

In [28]:
%%sql
SELECT first_name, last_name, email
FROM customer
WHERE first_name = 'JESSIE'

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
2 rows affected.

[('JESSIE', 'BANKS', 'JESSIE.BANKS@sakilacustomer.org'),
 ('JESSIE', 'MILAM', 'JESSIE.MILAM@sakilacustomer.org')]

In [27]:
%%sql
SELECT concat(cust.last_name, ', ', cust.first_name) AS full_name
FROM
    (SELECT first_name, last_name, email
    FROM customer
    WHERE first_name = 'JESSIE') AS cust
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
2 rows affected.

[('BANKS, JESSIE',), ('MILAM, JESSIE',)]

### 02 Defining Table Aliases

In [ ]:
%%sql
SELECT c.first_name, c.last_name,
    time(r.rental_date) AS rental_time
FROM customer AS c
    INNER JOIN rental AS r
    ON c.customer_id = r.customer_id
WHERE date(r.rental_date) = '2005-06-14'
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[('JEFFERY', 'PINSON', datetime.timedelta(seconds=82413)),
 ('ELMER', 'NOE', datetime.timedelta(seconds=82513)),
 ('MINNIE', 'ROMERO', datetime.timedelta(seconds=82834)),
 ('MIRIAM', 'MCKINNEY', datetime.timedelta(seconds=83228)),
 ('DANIEL', 'CABRAL', datetime.timedelta(seconds=83378))]

### 03 `WHERE` Clause

In [15]:
%%sql
/*Select distinct ratings from film*/
SELECT DISTINCT f.rating
FROM film AS f
ORDER BY f.rating;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[('G',), ('PG',), ('PG-13',), ('R',), ('NC-17',)]

In [16]:
%%sql
/*Select distinct rental_duration from film*/
SELECT DISTINCT f.rental_duration
FROM film AS f
ORDER BY f.rental_duration;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(3,), (4,), (5,), (6,), (7,)]

In [17]:
%%sql
/*Select film_id and title from film 
  where rating is 'G' and rental_duration is 7*/
SELECT f.film_id, f.title
FROM film AS f
WHERE f.rating = 'G' AND f.rental_duration = 7
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(80, 'BLANKET BEVERLY'),
 (89, 'BORROWERS BEDAZZLED'),
 (97, 'BRIDE INTRIGUE'),
 (128, 'CATCH AMISTAD'),
 (153, 'CITIZEN SHREK')]

In [18]:
%%sql
/*Select film_id and title from film 
  where (rating is 'G' and rental_duration is 7) OR 
  (rating is 'PG' and rental_duration is less than 4)*/
SELECT f.film_id, f.title
FROM film AS f
WHERE (f.rating = 'G' AND f.rental_duration = 7) OR
      (f.rating = 'PG' AND f.rental_duration < 4)
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(6, 'AGENT TRUMAN'),
 (37, 'ARIZONA BANG'),
 (65, 'BEHAVIOR RUNAWAY'),
 (80, 'BLANKET BEVERLY'),
 (89, 'BORROWERS BEDAZZLED')]

### 04 `GROUP BY` Clause

In [ ]:
# Find all of the customers who have rented 40 or more films

In [14]:
%%sql
SELECT c.first_name, c.last_name,count(*) AS rentals_count
FROM rental AS r
LEFT JOIN customer AS c
ON r.customer_id = c.customer_id
GROUP BY c.customer_id
HAVING rentals_count >= 40
ORDER BY rentals_count DESC
LIMIT 50;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
7 rows affected.

[('ELEANOR', 'HUNT', 46),
 ('KARL', 'SEAL', 45),
 ('CLARA', 'SHAW', 42),
 ('MARCIA', 'DEAN', 42),
 ('TAMMY', 'SANDERS', 41),
 ('SUE', 'PETERS', 40),
 ('WESLEY', 'BULL', 40)]

### 05 `ORDER BY` Clause

In [ ]:
%%sql
SELECT r.rental_id, c.first_name, c.last_name,
    r.rental_date
FROM rental AS r
LEFT JOIN customer AS c
ON r.customer_id = c.customer_id
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1, 'CHARLOTTE', 'HUNTER', datetime.datetime(2005, 5, 24, 22, 53, 30)),
 (2, 'TOMMY', 'COLLAZO', datetime.datetime(2005, 5, 24, 22, 54, 33)),
 (3, 'MANUEL', 'MURRELL', datetime.datetime(2005, 5, 24, 23, 3, 39)),
 (4, 'ANDREW', 'PURDY', datetime.datetime(2005, 5, 24, 23, 4, 41)),
 (5, 'DELORES', 'HANSEN', datetime.datetime(2005, 5, 24, 23, 5, 21))]

In [9]:
%%sql
SELECT r.rental_id, c.first_name, c.last_name,
    TIME(r.rental_date) AS rental_time
FROM rental AS r
LEFT JOIN customer AS c
ON r.customer_id = c.customer_id
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1, 'CHARLOTTE', 'HUNTER', datetime.timedelta(seconds=82410)),
 (2, 'TOMMY', 'COLLAZO', datetime.timedelta(seconds=82473)),
 (3, 'MANUEL', 'MURRELL', datetime.timedelta(seconds=83019)),
 (4, 'ANDREW', 'PURDY', datetime.timedelta(seconds=83081)),
 (5, 'DELORES', 'HANSEN', datetime.timedelta(seconds=83121))]

In [11]:
%%sql
SELECT r.rental_id, c.first_name, c.last_name,
    TIME(r.rental_date) AS rental_time
FROM rental AS r
LEFT JOIN customer AS c
ON r.customer_id = c.customer_id
WHERE DATE(r.rental_date) = '2005-06-14'
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1158, 'JEFFERY', 'PINSON', datetime.timedelta(seconds=82413)),
 (1159, 'ELMER', 'NOE', datetime.timedelta(seconds=82513)),
 (1160, 'MINNIE', 'ROMERO', datetime.timedelta(seconds=82834)),
 (1161, 'MIRIAM', 'MCKINNEY', datetime.timedelta(seconds=83228)),
 (1162, 'DANIEL', 'CABRAL', datetime.timedelta(seconds=83378))]

In [12]:
%%sql
SELECT r.rental_id, c.first_name, c.last_name,
    TIME(r.rental_date) AS rental_time
FROM rental AS r
LEFT JOIN customer AS c
ON r.customer_id = c.customer_id
WHERE DATE(r.rental_date) = '2005-06-14'
ORDER BY c.last_name, c.first_name
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(1162, 'DANIEL', 'CABRAL', datetime.timedelta(seconds=83378)),
 (1166, 'CATHERINE', 'CAMPBELL', datetime.timedelta(seconds=83823)),
 (1168, 'HERMAN', 'DEVORE', datetime.timedelta(seconds=84909)),
 (1169, 'AMBER', 'DIXON', datetime.timedelta(seconds=85376)),
 (1164, 'JOYCE', 'EDWARDS', datetime.timedelta(seconds=83786))]

## Exercises

### Exercise 3-1

In [4]:
%%sql
-- Retrieve the actor ID, first name, and last name for all actors. Sort by last name and
-- then by first name.

SELECT actor_id, first_name, last_name
FROM actor
ORDER BY last_name, first_name
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(58, 'CHRISTIAN', 'AKROYD'),
 (182, 'DEBBIE', 'AKROYD'),
 (92, 'KIRSTEN', 'AKROYD'),
 (118, 'CUBA', 'ALLEN'),
 (145, 'KIM', 'ALLEN')]

### Exercise 3-2

In [5]:
%%sql
-- Retrieve the actor ID, first name, and last name for all actors whose last name equals
-- 'WILLIAMS' or 'DAVIS'.

SELECT actor_id, first_name, last_name
FROM actor
WHERE last_name IN ('WILLIAMS', 'DAVIS');

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
6 rows affected.

[(4, 'JENNIFER', 'DAVIS'),
 (101, 'SUSAN', 'DAVIS'),
 (110, 'SUSAN', 'DAVIS'),
 (72, 'SEAN', 'WILLIAMS'),
 (137, 'MORGAN', 'WILLIAMS'),
 (172, 'GROUCHO', 'WILLIAMS')]

### Exercise 3-3

In [ ]:
# Write a query against the rental table that returns the IDs of the customers who ren‐
# ted a film on July 5, 2005 (use the rental.rental_date column, and you can use the
# date() function to ignore the time component). Include a single row for each distinct
# customer ID.

In [6]:
%%sql
SELECT DISTINCT customer_id, rental_date
FROM rental
WHERE DATE(rental_date) = '2005-07-05'
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[(565, datetime.datetime(2005, 7, 5, 22, 49, 24)),
 (242, datetime.datetime(2005, 7, 5, 22, 51, 44)),
 (37, datetime.datetime(2005, 7, 5, 22, 56, 33)),
 (60, datetime.datetime(2005, 7, 5, 22, 57, 34)),
 (594, datetime.datetime(2005, 7, 5, 22, 59, 53))]

### Exercise 3-4

In [7]:
%%sql
/*
Select the email and return date for customers who rented a film on June 14, 2005.
Order the results by return date in descending order and limit the results to 5 rows.
*/
SELECT c.email, r.return_date
FROM customer AS c
    INNER JOIN rental AS r
    ON c.customer_id = r.customer_id
WHERE date(r.rental_date) = '2005-06-14'
ORDER BY r.return_date DESC
LIMIT 5;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
5 rows affected.

[('DANIEL.CABRAL@sakilacustomer.org', datetime.datetime(2005, 6, 23, 22, 0, 38)),
 ('TERRANCE.ROUSH@sakilacustomer.org', datetime.datetime(2005, 6, 23, 21, 53, 46)),
 ('MIRIAM.MCKINNEY@sakilacustomer.org', datetime.datetime(2005, 6, 21, 17, 12, 8)),
 ('GWENDOLYN.MAY@sakilacustomer.org', datetime.datetime(2005, 6, 20, 2, 40, 27)),
 ('JEANETTE.GREENE@sakilacustomer.org', datetime.datetime(2005, 6, 19, 23, 26, 46))]